apps/load-test/artillery/phase1-50users.yaml
# Artillery Phase 1: 50명 부하테스트
# 목적: 기본 검증 및 시스템 안정성 확인
# 실행: pnpm artillery:phase1

config:
  target: "http://localhost:3000"
  phases:
    - duration: 120
      arrivalCount: 50  # 120초 동안 총 50명의 유저를 균등하게 분산
      name: "Phase 1 - 50 users gradual ramp-up"
  engines:
    socketio:
      path: "/socket.io"
      transports: ["websocket"]

scenarios:
  - name: "Audience joins room and consumes media"
    engine: socketio
    flow:
      # 1. 강의실 입장
      - emit:
          channel: "join_room"
          data:
            roomId: "{{ roomId }}"
            participantId: "user-{{ $randomString() }}"
      - think: 1

      # 2. Send Transport 생성
      - emit:
          channel: "create_transport"
          data:
            direction: "send"
      - think: 0.5

      # 3. Receive Transport 생성
      - emit:
          channel: "create_transport"
          data:
            direction: "recv"
      - think: 0.5

      # 4. 발표자의 audio Producer ID 조회
      - emit:
          channel: "get_producer"
          data:
            targetParticipantId: "{{ presenterParticipantId }}"
            type: "audio"
      - think: 0.3

      # 5. 발표자의 video Producer ID 조회
      - emit:
          channel: "get_producer"
          data:
            targetParticipantId: "{{ presenterParticipantId }}"
            type: "video"
      - think: 0.3

      # 6. 발표자의 screen Producer ID 조회
      - emit:
          channel: "get_producer"
          data:
            targetParticipantId: "{{ presenterParticipantId }}"
            type: "screen"
      - think: 0.3

      # 7. 제스처 전송 (5회 반복)
      - loop:
          - emit:
              channel: "action_gesture"
              data:
                gesture: "{{ gesture }}"
          - think: 3
        count: 5

      # 8. 강의실 퇴장
      - emit:
          channel: "leave_room"

# 변수 정의
# 사용 전 반드시 수정 필요:
# - roomId: 테스트 전 생성한 강의실 ID
# - presenterParticipantId: 발표자 참가자 ID
variables:
  roomId:
    - "test-room-1"  # 실제 테스트 시 변경 필요
  presenterParticipantId:
    - "presenter-1"  # 실제 테스트 시 변경 필요
  gesture:
    - "thumbs_up"
    - "thumbs_down"
    - "hand_raise"
    - "ok_sign"